# 1) Перебор пустых значений в таблице
for i11 in [0, 1]:
    for i12 in [0, 1]:
        for i14 in [0, 1]:
            for i21 in [0, 1]:
                for i23 in [0, 1]:
                    for i24 in [0, 1]:
                        for i31 in [0, 1]:
                            # Составим таблицу
                            t = (
                                (i11, i12, 1, i14, 0),
                                (i21, 0, i23, i24, 0),
                                (i31, 1, 0, 0, 0)
                            )
                            # И проверим, что строки различны
                            if len({t[0], t[1], t[2]}) == 3:
                                # 2) Перебор переменных в столбцы
                                for x in range(4):
                                    for y in range(4):
                                        for z in range(4):
                                            for w in range(4):
                                                # Проверим, что у каждой переменной свой номер столбца
                                                if len({x,y,z,w}) == 4:
                                                    # 3) Проверка строк на выполнение условий
                                                    # -- row[-1] это F
                                                    if all( [ (((row[w] <= row[y]) <= row[x]) or (not row[z])) == row[-1] for row in t ] ):
                                                        print(f"wxyz: {w+1}{x+1}{y+1}{z+1}")
