# 1) Перебор пустых значений в таблице
for a in [0, 1]:
    for b in [0, 1]:
        for c in [0, 1]:
            # Составим таблицу
            t = (
                (a, 0, 0, 0),
                (b, 0, c, 0)
            )
            # И проверим, что строки различны
            if len({t[0], t[1]}) == 2:
            # 2) Перебор переменных в столбцы
                for x in range(3):
                    for y in range(3):
                        for z in range(3):
                            # Проверим, что у каждой переменной свой номер столбца
                            if len({x,y,z}) == 3:
                                # 3) Проверка строк на выполнение условий
                                # (x ∨ y) → (z ≡ x)
                                ans = 0
                                for row in t:
                                    # (a, 0, 0, 0)
                                    if ((row[x] or row[y]) <= (row[z] == row[x])) == row[-1]:
                                        ans += 1
                                if ans == 2:
                                    print("x -", x, "y -", y, "z -", z)
