answer = 0
# Помимо пути к файлу рекомендую еще прописывать кодировку (encoding) UTF8
for line in open('Inf2025\\Разборы_вариантов\\Демо\\3\\3.txt', encoding="UTF8"):
    # В line лежат значения через таб (все str типа)
    s = line.split()
    # Условие 1: за период со 2 по 10 августа включительно
    c1 = 2 <= int(s[1].split('/')[1]) <= 10
    # Условие 2: ID магазина M10 или M15
    c2 = s[2] in ["M10", "M15"]
    # Условие 3: Артикул 4, 5, 6 или 7
    c3 = s[3] in ["4", "5", "6", "7"]
    # Условие 4: Тип операции - Поступление
    c4 = s[5] == "Поступление"

    if c1 and c2 and c3 and c4:
        """
        4 - 250
        5 - 800
        6 - 500
        7 - 1000
        """
        amount = int(s[4]) # количество упаковок
        if s[3] == "4":
            answer += 250 * amount
        if s[3] == "5":
            answer += 800 * amount
        if s[3] == "6":
            answer += 500 * amount
        if s[3] == "7":
            answer += 1000 * amount

print(answer / 1000) # answer в граммах -> переводим в кг

# Ответ: 2550 
