
def f(n):
    return format(n, '#010b')[2:]

# Адрес узла
print(f(98), f(162), f(77), f(94), sep='.')
# Адрес сети
print(f(98), f(162), f(64), f(0), sep='.')

# Адрес узла: 01100010.10100010.01001101.01011110
# Адрес сети: 01100010.10100010.01000000.00000000
# Подберем такие маски, что маска & адрес узла = адрес сети

# Поскольку первые два байта адреса узла и сети совпадают, то будем перебирать маску под последние два байта
# Узел (уберем точку как разделитель):
u = int("0100110101011110", 2)
s = int("0100000000000000", 2)

masks = [
    '1' * i + '0' * (16-i) for i in range(17)
]
""" masks:
0000000000000000
1000000000000000
1100000000000000
1110000000000000
1111000000000000
1111100000000000
1111110000000000
1111111000000000
1111111100000000
1111111110000000
1111111111000000
1111111111100000
1111111111110000
1111111111111000
1111111111111100
1111111111111110
1111111111111111
"""

result = 0
for m in masks:
    if int(m, 2) & u == s: result += 1
    
print(result)

