
def f(n):
    return format(n, '#010b')[2:]

# Адрес 1
print(f(114), f(91), f(57), f(39), sep='.')
# Адрес 2
print(f(114), f(91), f(19), f(61), sep='.')

# Адрес 1: 01110010.01011011.00|111001.00100111
# Адрес 2: 01110010.01011011.00|010011.00111101
# Подберем такую маску, что количество адресов в сети будет наименьшим
# Маска  : 11111111.11111111.11|000000.00000000

ones = "11111111.11111111.11000000.00000000".count('1')
zeros = "11111111.11111111.11000000.00000000".count('0')
result = 0
for i in range(2**zeros):
    if (ones + f(i).count('1')) % 2 == 0: result += 1
print(result)